of-run/canal/canal3D/04-canal3DRAS-refi/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication setFields
$application 2>&1 | tee "$application.log"
#runApplication $application

#------------------------------------------------------------------------------
